#ตัวดำเนินการเปรียบเทียบ
    #เทียบอย่างน้อย 2 ค่า
    # Type เดียวกัน
    # Answer = True or False

x,y=5,12
print("ค่า x มากกว่าค่า y หรือไม่ ? : ", x>y)
print("ค่า x น้อยกว่าค่า y หรือไม่ ? : ", x<y)
print("ค่า x เท่ากับค่า y หรือไม่ ? : ", x==y)
print("ค่า x ไม่เท่ากับ y หรือไม่ ? : ", x!=y)
a,b=10,10
print("ค่า x มากกว่า หรือ เท่ากับ ค่า y หรือไม่ ? : " ,a>=b)
print("ค่า a น้อยกว่า หรือ เท่ากับ ค่า b หรือไม่ ? : ", a<=b)
# 3 ค่า
print("x มากกว่า b และ มากกว่า a หรือไม่ : ", x>b>a)
print("y มากกว่า a และ y น้อยกว่า x และ x น้อยกว่า b หรือไม่ :", b>x>y>a )