# แลกเงินและหาจำนวนแบงค์

# 2000 => 1000 2 ใบ
# 1500 => 1000 1 ใบ , 500 1 ใบ
# 1800 => 1000 1 ใบ , 100 1 ใบ
# 100 => 50 2 ใบ

A=int(input("ป้อนจำนวนเงินของคุณ : "))

if A>=1000 :
    print("แบงค์ 1000 bath ",A//1000,"ใบ")
    A = A%1000 #เอาเศษไปใช้ต่อ
if A>=500 :
    print("แบงค์ 500 bath ",A//500,"ใบ")
    A%=500
if A>=100 :
    print("แบงค์ 100 bath ",A//100,"ใบ")
    A%=100
if A>=50 :
    print("แบงค์ 50 bath ",A//50,"ใบ")
    A%=50
if A>=20 :
    print("แบงค์ 20 bath ",A//20,"ใบ")
    A%=20
if A>=10 :
    print("เหรียญ 10 bath ",A//10,"เหรียญ")
    A%=10
if A>=5 :
    print("เหรียญ 5 bath ",A//5,"เหรียญ")
    A%5
if A>=2 :
    print("เหรียญ 2 bath ",A//2,"เหรียญ")
    A%=2
if A>=1 :
    print("เหรียญ 1 bath ",A//1,"เหรียญ")
    A%=1